## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/7935602382)



<pre><code>Plan: 5 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * github_actions_variable.gcp_terraform_executor_service_account_email
  * github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider
  * module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main
  * module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool_provider.main
  * module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.workload_identity_service_account["terraform_executor_pull_prod_plan"]
* Update
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # github_actions_variable.gcp_terraform_executor_service_account_email will be created
  + resource "github_actions_variable" "gcp_terraform_executor_service_account_email" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
      + variable_name = "gcp_terraform_executor_service_account_email"
    }

  # github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider will be created
  + resource "github_actions_variable" "gh_com_kyma_project_gcp_workload_identity_federation_provider" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "gh_com_kyma_project_gcp_workload_identity_federation_provider"
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
        # (12 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main will be created
  + resource "google_iam_workload_identity_pool" "main" {
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "projects/\"sap-kyma-prow\"/regions/\"europe-west4\"/zones/<null>"
      + state                     = (known after apply)
      + workload_identity_pool_id = "github-com-kyma-project-pool"
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool_provider.main will be created
  + resource "google_iam_workload_identity_pool_provider" "main" {
      + attribute_mapping                  = {
          + "attribute.actor"               = "assertion.actor"
          + "attribute.aud"                 = "assertion.aud"
          + "attribute.event_name"          = "assertion.event_name"
          + "attribute.repository_id"       = "assertion.repository_id"
          + "attribute.repository_owner_id" = "assertion.repository_owner_id"
          + "attribute.workflow"            = "assertion.workflow"
          + "attribute.workflow_ref"        = "assertion.workflow_ref"
          + "google.subject"                = "\"repository_id:\" + assertion.repository_id + \":repository_owner_id:\" + assertion.repository_owner_id + \":workflow:\" + assertion.workflow"
        }
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "projects/\"sap-kyma-prow\"/regions/\"europe-west4\"/zones/<null>"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "github-com-kyma-project-pool"
      + workload_identity_pool_provider_id = "github-com-kyma-project-provider"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.workload_identity_service_account["terraform_executor_pull_prod_plan"] will be created
  + resource "google_service_account_iam_member" "workload_identity_service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 5 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ artifact_registry                                   = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2024-02-16T14:53:17.921334Z" -> "2024-02-16T19:59:32.154945Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":9906,"Program":"tfcmt","SHA1":"86eada94b7a11b29dabba4b747c35cc907b6a19a","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->